In [171]:
import pandas as pd

names=['chlorhexidine', 'cyntomycin', 'afobazol']
counts=[15, 18, 7]

def create_medications(names, counts):
    medications = pd.Series(data=counts, index=names, name='medications')
    return medications

def get_percent(medications, name):
    return medications.loc[name]/sum(medications) * 100

medications = create_medications(names, counts)
print(medications)
get_percent(medications, 'chlorhexidine')

chlorhexidine    15
cyntomycin       18
afobazol          7
Name: medications, dtype: int64

37.5

In [65]:
incomes = [478, 512, 196]
expenses = [156, 130, 270]
years = [2018, 2019, 2020]

def create_companyDF(income, expenses, years):
    df = pd.DataFrame({'Income':income, 'Expenses': expenses}, index=years)
    return df

tbl = create_companyDF(incomes, expenses, years)
display(tbl)

def get_profit(df, year):
    if year not in df.index: return None
    profit = df.loc[year, 'Income'] - df.loc[year, 'Expenses']
    print(profit)
    return profit
    
print(get_profit(tbl, 218))

display(tbl)
tbl.iloc[2, 0]
tbl.loc[[2018, 2019], 'Income']

      Income  Expenses
2018     478       156
2019     512       130
2020     196       270

None

      Income  Expenses
2018     478       156
2019     512       130
2020     196       270

2018    478
2019    512
Name: Income, dtype: int64

In [72]:
data = pd.DataFrame([[0,1], [1, 0], [1, 1]], columns=['А', 'B'])
display(data)

data.shape

   А  B
0  0  1
1  1  0
2  1  1

(3, 2)

In [73]:
data.tail(2)

   А  B
1  1  0
2  1  1

In [170]:
melb_data = pd.read_csv('data/melb_data.csv')
melb_data['Car'] = melb_data['Car'].astype('int64')
melb_data['Bedroom'] = melb_data['Bedroom'].astype('int64')
melb_data['Bathroom'] = melb_data['Bathroom'].astype('int64')
melb_data['Propertycount'] = melb_data['Propertycount'].astype('int64')
melb_data['YearBuilt'] = melb_data['YearBuilt'].astype('int64')
display(melb_data)

,index,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,...,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount,Coordinates
0,0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,...,1,202.0,126.0,1970,Yarra,-37.79960,144.99840,Northern Metropolitan,4019,"-37.7996, 144.9984"
1,1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,...,0,156.0,79.0,1900,Yarra,-37.80790,144.99340,Northern Metropolitan,4019,"-37.8079, 144.9934"
2,2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,...,0,134.0,150.0,1900,Yarra,-37.80930,144.99440,Northern Metropolitan,4019,"-37.8093, 144.9944"
3,3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,...,1,94.0,126.0,1970,Yarra,-37.79690,144.99690,Northern Metropolitan,4019,"-37.7969, 144.9969"
4,4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,...,2,120.0,142.0,2014,Yarra,-37.80720,144.99410,Northern Metropolitan,4019,"-37.8072, 144.9941"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
13575,13575,Wheelers Hill,12 Strada Cr,4,h,1245000.0,S,Barry,26/08/2017,16.7,...,2,652.0,126.0,1981,NaN,-37.90562,145.16761,South-Eastern Metropolitan,7392,"-37.90562, 145.16761"
13576,13576,Williamstown,77 Merrett Dr,3,h,1031000.0,SP,Williams,26/08/2017,6.8,...,2,333.0,133.0,1995,NaN,-37.85927,144.87904,Western Metropolitan,6380,"-37.85927, 144.87904"
13577,13577,Williamstown,83 Power St,3,h,1170000.0,S,Raine,26/08/2017,6.8,...,4,436.0,126.0,1997,NaN,-37.85274,144.88738,Western Metropolitan,6380,"-37.85274, 144.88738"
13578,13578,Williamstown,96 Verdon St,4,h,2500000.0,PI,Sweeney,26/08/2017,6.8,...,5,866.0,157.0,1920,NaN,-37.85908,144.89299,Western Metropolitan,6380,"-37.85908, 144.89299"
13579,13579,Yarraville,6 Agnes St,4,h,1285000.0,SP,Village,26/08/2017,6.3,...,1,362.0,112.0,1920,NaN,-37.81188,144.88449,Western Metropolitan,6543,"-37.81188, 144.88449"

In [80]:
type(melb_data['Type'].loc[2])
type(melb_data['Date'].loc[2])
print(melb_data['Date'].loc[2])
melb_data['Price'].std()

4/03/2017

639310.724296018

In [81]:
melb_data['Propertycount'].max()

21650.0

In [83]:
round(melb_data['Distance'].std())

6

In [84]:
building_area_med = melb_data['BuildingArea'].median()
building_area_mean = melb_data['BuildingArea'].mean()
print(round(abs(building_area_med - building_area_mean)/building_area_mean * 100))

10

In [100]:
row = pd.DataFrame({'Row':[1, 2, 4, 2, 3, 2, 1, 5, 6, 4, 4]})
row
print(row['Row'].mode())

0    4
Name: Row, dtype: int64

In [102]:
melb_data['Rooms'].mode()

0    3
Name: Rooms, dtype: int64

In [111]:
melb_data[melb_data['Bathroom'] == 0].shape[0]

34

In [117]:
melb_data[(melb_data['SellerG'] == 'Nelson') & (melb_data['Price'] > 3000000)].shape[0]

5

In [119]:
melb_data[melb_data['BuildingArea'] == 0]['Price'].min()

412500.0

In [124]:
round(melb_data[(melb_data['Price'] < 1000000) & ((melb_data['Rooms'] > 5) | (melb_data['YearBuilt'] > 2015))]['Price'].mean())

769239

In [125]:
melb_data[(melb_data['Price'] < 3000000) & (melb_data['Type'] == 'h')]['Regionname'].mode()

0    Northern Metropolitan
Name: Regionname, dtype: object

In [126]:
# 9. Закрепление знаний

student_data = pd.read_csv('data/students_performance.csv')
display(student_data)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [127]:
display(student_data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

None

In [128]:
student_data.shape[0]

1000

In [129]:
student_data.loc[155, 'writing score']

88

In [131]:
student_data['math score'].mean()

66.089

In [132]:
student_data.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [133]:
student_data.describe(include='object')

,gender,race/ethnicity,parental level of education,lunch,test preparation course
count,1000,1000,1000,1000,1000
unique,2,5,6,2,2
top,female,group C,some college,standard,none
freq,518,319,226,645,642

In [134]:
student_data['race/ethnicity'].value_counts(normalize=True)

group C    0.319
group D    0.262
group B    0.190
group E    0.140
group A    0.089
Name: race/ethnicity, dtype: float64

In [155]:
round(student_data[student_data['test preparation course'] == 'completed']['reading score'].mean())

74

In [154]:
student_data['math score'].value_counts()[0]

1

In [140]:
student_data[student_data['math score'] == 0].shape[0]

1

In [158]:
mask_std = student_data['lunch'] == 'standard'
mask_free = student_data['lunch'] == 'free/reduced'
display(round(student_data[mask_std]['math score'].mean()))
display(round(student_data[mask_free]['math score'].mean()))

70

59

In [164]:
round(student_data['parental level of education'].value_counts(1)["bachelor's degree"]*100)

12

In [169]:
score1 = student_data[student_data['race/ethnicity'] == 'group A']['writing score'].median()
score2 = student_data[student_data['race/ethnicity'] == 'group C']['writing score'].mean()
round(abs(score1 - score2))

6